w4d4/music_app/app/controllers/albums_controller.rb

    def new
        @album = Album.new
        @bands = Band.all
        @current_band = Band.find_by(id: params[:band_id])
---
SELECT "bands".* FROM "bands"
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @album = Album.new(album_params)
        if @album.save
            redirect_to album_url(@album)
        else
            flash.now[:errors] = @album.errors.full_messages
            @bands = Band.all
            @current_band = Band.find_by(id: params[:album][:band_id])
---
INSERT INTO "albums" ("title", "year", "band_id", "created_at", "updated_at", "album_type") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test"], ["year", 2000], ["band_id", 1], ["created_at", "2019-05-02 20:45:31.126129"], ["updated_at", "2019-05-02 20:45:31.126129"], ["album_type", "live"]]
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def edit
        @album = Album.find_by(id: params[:id])
        @bands = Band.all
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "bands".* FROM "bands"

    def update
        @album = Album.find_by(id:params[:id])
        if @album.update(album_params)
            redirect_to album_url(@album)
        else
            flash.now[:errors] = @album.errors.full_messages
            @bands = Band.all
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "albums" SET "title" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["title", "Win the beatless"], ["updated_at", "2019-05-02 20:34:38.119656"], ["id", 2]]
SELECT "bands".* FROM "bands"

    def destroy
        @album = Album.find_by(id:params[:id])
        @band = @album.band
        @album.destroy
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 1]]