w4d4/music_app/app/controllers/tracks_controller.rb

SELECT "albums".* FROM "albums"
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def new
        @track= Track.new
        @albums = Album.all
        @current_album = Album.find_by(id: params[:album_id])