W4D2/NintyNineCats/app/models/cat_rental_request.rb

    def approve!
        transaction do
            self.update(status: 'APPROVED')
---
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2019-04-30 21:19:24.870887"], ["id", 5]]

    def overlapping_requests
        CatRentalRequest.where(' cat_id = ?  AND
            (start_date BETWEEN ? AND ? OR
            end_date BETWEEN ? AND ?) ', self.cat_id, self.start_date, self.end_date, self.start_date, self.end_date)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]