W4D2/NintyNineCats/app/views/cats/show.html.erb

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 ORDER BY "cat_rental_requests"."start_date" ASC  [["cat_id", 9]]
---
    <tbody>
        <% @cat.cat_rental_requests.order(:start_date).each do |rental| %>