W4D2/NintyNineCats/app/controllers/cat_rental_requests_controller.rb

    def create
        @request = CatRentalRequest.new(cat_rental_request_params)
        if @request.save
            redirect_to cat_url(cat_rental_request_params[:cat_id])
        else
            @cats = Cat.all
---
INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 9], ["start_date", "2019-04-09"], ["end_date", "2019-04-19"], ["created_at", "2019-04-30 20:50:54.804707"], ["updated_at", "2019-04-30 20:50:54.804707"]]
SELECT "cats".* FROM "cats"

    def approve
        @request = CatRentalRequest.find(params[:id])
---
SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]